Revit 2024 API
FilterableValueProvider.GetElementIdValue Method
 Gets an ElementId value from the given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ElementId GetElementIdValue(
	Element element
)
Visual Basic
Public Function GetElementIdValue ( _
	element As Element _
) As ElementId
Visual C++
public:
ElementId^ GetElementIdValue(
	Element^ element
)
Parameters
element
Type: Autodesk.Revit.DB.Element
 The element to query.
Return Value
 The ElementId value from the element.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FilterableValueProvider Class
Autodesk.Revit.DB Namespace